; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-12)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(free left)
(at ball1 rooma)
(at ball2 room3)
(at ball3 room3)
(at ball4 room4)
(at ball5 room5)
(at ball6 room5)
(at ball7 room5)
(at ball8 room5)
(at ball9 room6)
(at ball10 room6)
(at ball11 room6)
(at ball12 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room5)
(at ball2 room5)
(at ball3 room5)
(at ball4 room5)
(at ball5 room5)
(at ball6 room5)
(at ball7 room5)
(at ball8 room5)
(at ball9 room5)
(at ball10 room5)
(at ball11 room5)
(at ball12 room5)
)
)
)

; plan
1. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 4 of 12
2. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 4 of 12
3. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 4 of 12
4. (drop ball1 room5 left)
   deleted: (carry ball1 left)
   added: (at ball1 room5) (free left)
   goals met: 5 of 12
5. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 5 of 12
6. (pick ball9 room6 left)
   deleted: (at ball9 room6) (free left)
   added: (carry ball9 left)
   goals met: 5 of 12
7. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 5 of 12
8. (drop ball9 room5 left)
   deleted: (carry ball9 left)
   added: (at ball9 room5) (free left)
   goals met: 6 of 12
9. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 6 of 12
10. (pick ball12 room6 left)
   deleted: (at ball12 room6) (free left)
   added: (carry ball12 left)
   goals met: 6 of 12
11. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 6 of 12
12. (drop ball12 room5 left)
   deleted: (carry ball12 left)
   added: (at ball12 room5) (free left)
   goals met: 7 of 12
13. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 7 of 12
14. (pick ball11 room6 left)
   deleted: (at ball11 room6) (free left)
   added: (carry ball11 left)
   goals met: 7 of 12
15. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 7 of 12
16. (drop ball11 room5 left)
   deleted: (carry ball11 left)
   added: (at ball11 room5) (free left)
   goals met: 8 of 12
17. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 8 of 12
18. (pick ball10 room6 left)
   deleted: (at ball10 room6) (free left)
   added: (carry ball10 left)
   goals met: 8 of 12
19. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 8 of 12
20. (drop ball10 room5 left)
   deleted: (carry ball10 left)
   added: (at ball10 room5) (free left)
   goals met: 9 of 12
21. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 9 of 12
22. (pick ball4 room4 left)
   deleted: (at ball4 room4) (free left)
   added: (carry ball4 left)
   goals met: 9 of 12
23. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 9 of 12
24. (drop ball4 room5 left)
   deleted: (carry ball4 left)
   added: (at ball4 room5) (free left)
   goals met: 10 of 12
25. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 10 of 12
26. (pick ball3 room3 left)
   deleted: (at ball3 room3) (free left)
   added: (carry ball3 left)
   goals met: 10 of 12
27. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 10 of 12
28. (drop ball3 room5 left)
   deleted: (carry ball3 left)
   added: (at ball3 room5) (free left)
   goals met: 11 of 12
29. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 11 of 12
30. (pick ball2 room3 left)
   deleted: (at ball2 room3) (free left)
   added: (carry ball2 left)
   goals met: 11 of 12
31. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 11 of 12
32. (drop ball2 room5 left)
   deleted: (carry ball2 left)
   added: (at ball2 room5) (free left)
   goals met: 12 of 12
